public class Main {
    public static void main(String[] args) {
        int d = 33;
        int m = 4;
        if (d >= 20 && d <= 31 && m == 1 || d >= 1 && d <= 18 && m == 2) {
            System.out.printf("Водолей");
        } else if (d>=19 && d<=28 && m==2 || d>=1 && d<=20 && m==3) {
            System.out.printf("Рыбы");
        } else if (d>=21 && d<=31 && m==3 || d>=1 && d<=19 && m==4) {
            System.out.printf("Овен");
        } else if (d>=20 && d<=30 && m==4 || d>=1 && d<=20 && m==5) {
            System.out.printf("Телец");
        } else if (d>=21 && d<=31 && m==5 || d>=1 && d<=21 && m==6) {
            System.out.printf("Близнецы");
        } else if (d>=22 && d<=30 && m==6 || d>=1 && d<=22 && m==7) {
            System.out.printf("Рак");
        } else if (d>=23 && d<=31 && m==7 || d>=1 && d<=22 && m==8) {
            System.out.printf("Лев");
        } else if (d>=23 && d<=31 && m==8 || d>=1 && d<=22 && m==9) {
            System.out.printf("Дева");
        } else if (d>=23 && d<=30 && m==9 || d>=1 && d<=22 && m==10) {
            System.out.printf("Весы");
        } else if (d>=23 && d<=31 && m==10 || d>=1 && d<=22 && m==11) {
            System.out.printf("Скорпион");
        } else if (d>=23 && d<=30 && m==11 || d>=1 && d<=21 && m==12) {
            System.out.printf("Стрелец");
        } else if (d>=22 && d<=31 && m==12 || d>=1 && d<=19 && m==1) {
            System.out.printf("Козерог");
        }else {
            System.out.printf("Нет такого знака");
        }
    }
}
/*Даны два целых числа: D (день) и M (месяц), определяющие правильную дату.
Вывести знак Зодиака, соответствующий этой дате: «Водолей» (20.1–18.2), «Рыбы»
(19.2–20.3), «Овен» (21.3–19.4), «Телец» (20.4–20.5), «Близнецы» (21.5–21.6),
"Рак" (22.6-22.7), «Лев» (23.7–22.8), «Дева» (23.8–22.9), «Весы» (23.9–22.10), «Скорпион»
(23.10–22.11), «Стрелец» (23.11–21.12), «Козерог» (22.12–19.1).
 */