//Реализовать подсчет факториала используя цикл for. Результат вывести на экран
public class Main {
    public static void main(String[] args) {
        int y=5;
        for (int x=1; x<=5; x++){
            y=x*y;
            System.out.println(y);
        }

    }
}